cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'thoughtbot/formulae'
tap '1password/tap'
tap 'jesseduffield/lazygit'
tap 'pkgxdev/made'

brew 'ack'
brew 'coreutils'
# brew 'ctags'
brew 'git-delta'
brew 'git-town'
brew 'difftastic'
brew 'lazygit'
brew 'mise'
brew 'fzf'
brew 'git'
brew 'go'
# brew 'graphviz'
# brew 'helm'
brew 'jq'
brew 'kubectl'
brew 'yh'
# brew 'python3'
brew 'onefetch'
brew 'rcm'
brew 'rg'
brew 'ripgrep'
brew 'selecta'
brew 'starship'
brew 'wget'

cask 'font-victor-mono'
cask 'ngrok'
cask 'warp'
cast '1password-cli'
cask 'pkgx'
# cask 'google-cloud-sdk'
# cask 'oracle-jdk'
