cask_args appdir: "/Applications"

# deps: general
# brew "java"
brew "cmake"

# deps: postgres
brew "readline"
brew "zlib"
brew "curl"
brew "ossp-uuid"
brew "icu4c"
brew "pkg-config"
brew "pgvector"

# ai
tap "sst/tap"
cask "claude-code"
brew "sst/tap/opencode"

# Utilities
# brew "kubectl"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-town"
brew "go"
brew "imagemagick"
brew "jq"
brew "just"
brew "lua"
brew "ripgrep"
brew "selecta"
brew "starship"
brew "wget"
brew "yh"

cask "font-victor-mono"
cask "ngrok"
cask "warp"

tap "1password/tap"
cask "1password-cli"

# Fly.io
brew "flyctl"

# Database
# brew "postgis"
brew "postgresql@17"

# Environment
brew "direnv"
brew "mise"

# Zed
cask "zed"

# Terminal
brew "eza"
brew "zsh"
brew "starship"
brew "lazygit" # TUI git terminal
# brew "superfile" # TUI file manager
# brew "yazi" # TUI file manager
# brew "rainfrog" # TUI database manager
